app/Controllers/Crud.php

INSERT INTO `surat` (`asalSurat`, `ni_AsalSurat`, `namaPengirim`, `emailPengirim`, `noTelpSender`, `noTelpCorp`, `sifatDoc`, `noSurat`, `perihal`, `tujuanSurat`) VALUES ('Instansi Pusat', 'tes', 'tes', 'rockypratama4@gmail.com', '08976266', '021333', 'Biasa', 'B-2188-3A', 'hal testing', '#')
---
        public function save()
    {
        $this->crud_model->save([
            'no_id' => $this->request->getVar('no_id'),
            'asalSurat' => $this->request->getVar('asalSurat'),
            'ni_AsalSurat' => $this->request->getVar('ni_AsalSurat'),
            'namaPengirim' => $this->request->getVar('namaPengirim'),
            'emailPengirim' => $this->request->getVar('emailPengirim'),
            'noTelpSender' => $this->request->getVar('noTelpSender'),
            'noTelpCorp' => $this->request->getVar('noTelpCorp'),
            'sifatDoc' => $this->request->getVar('sifatDoc'),
            'noSurat' => $this->request->getVar('noSurat'),
            'perihal' => $this->request->getVar('perihal'),
            'tujuanSurat' => $this->request->getVar('tujuanSurat')
        ]);